data/rail/soapenv.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://thalesgroup.com/RTTI/2013-11-28/Token/types" xmlns:ldb="http://thalesgroup.com/RTTI/2017-10-01/ldb/">
   <soapenv:Header>
      <typ:AccessToken>
         <typ:TokenValue>a1047c7c-0030-4c36-a9a2-15f9f75aecbb</typ:TokenValue>
      </typ:AccessToken>
   </soapenv:Header>
   <soapenv:Body>
      <ldb:GetDepBoardWithDetailsRequest>
         <ldb:numRows>5</ldb:numRows>
         <ldb:crs>SNS</ldb:crs>
         <!--Optional:-->
         <ldb:filterCrs>WAT</ldb:filterCrs>
         <!--Optional:-->
         <ldb:filterType>to</ldb:filterType>
         <!--Optional:-->
         <ldb:timeOffset>0</ldb:timeOffset>
         <!--Optional:-->
         <ldb:timeWindow>120</ldb:timeWindow>
      </ldb:GetDepBoardWithDetailsRequest>
   </soapenv:Body>
</soapenv:Envelope>